print("--- Завдання 1 ---")

# Введення a з перевіркою (аналогічно прикладу з методички)
a = int(input("Введіть a (1-100): "))
while a < 1 or a > 100:
    print("Число має бути в межах від 1 до 100")
    a = int(input("Введіть a: "))

# Введення b з перевіркою
b = int(input("Введіть b (1-100): "))
while b < 1 or b > 100:
    print("Число має бути в межах від 1 до 100")
    b = int(input("Введіть b: "))

# Обчислення X
if a > b:
    x = (b / a) + 61
elif a == b:
    x = -5
else: # a < b
    x = (b - a) / b

print(f"Результат X: {x:.2f}")
